#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_availability_zones.aws_azs: Reading...
module.ecs_service.module.container_definition["django-app"].data.aws_region.current: Reading...
module.ecs_service.data.aws_region.current: Reading...
module.ecs_service.module.container_definition["django-app"].aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/ecs/django-personal-site/django-app]
module.ecs_service.data.aws_caller_identity.current: Reading...
module.ecs_cluster.data.aws_partition.current: Reading...
module.ecs_service.data.aws_iam_policy_document.task_exec[0]: Reading...
module.ecs_cluster.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/ecs/django-prod]
aws_iam_role.ecs-host-role: Refreshing state... [id=ecs_host_role_prod]
module.ecs_service.data.aws_partition.current: Reading...
module.ecs_service.data.aws_region.current: Read complete after 0s [id=eu-west-1]
module.ecs_service.data.aws_iam_policy_document.task_exec[0]: Read complete after 0s [id=1415633931]
aws_iam_role.ecs-service-role: Refreshing state... [id=ecs_service_role_prod]
module.nat.data.aws_ami.this: Reading...
module.ecs_cluster.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecs_service.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecs_service.module.container_definition["django-app"].data.aws_region.current: Read complete after 0s [id=eu-west-1]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0e1d0243d02de04e0]
module.ecs_service.aws_iam_policy.task_exec[0]: Refreshing state... [id=arn:aws:iam::954050840447:policy/django-personal-site-20231020130010305600000003]
module.ecs_service.data.aws_iam_policy_document.task_exec_assume[0]: Reading...
module.ecs_service.data.aws_iam_policy_document.task_exec_assume[0]: Read complete after 0s [id=2291109037]
module.ecs_service.aws_iam_role.task_exec[0]: Refreshing state... [id=django-personal-site-20231020130010303600000001]
module.ecs_service.data.aws_caller_identity.current: Read complete after 0s [id=954050840447]
module.ecs_service.data.aws_iam_policy_document.tasks_assume[0]: Reading...
module.ecs_service.data.aws_iam_policy_document.tasks_assume[0]: Read complete after 0s [id=3252303218]
module.ecs_service.aws_iam_role.tasks[0]: Refreshing state... [id=django-personal-site-20231020130010304400000002]
module.ecs_service.aws_iam_role_policy_attachment.task_exec[0]: Refreshing state... [id=django-personal-site-20231020130010303600000001-20231020130010604800000005]
aws_iam_role_policy.ecs-service-role-policy: Refreshing state... [id=ecs_service_role_prod:ecs_service_role_policy]
aws_iam_instance_profile.ecs: Refreshing state... [id=ecs_instance_profile_prod]
aws_iam_role_policy.ecs-instance-role-policy: Refreshing state... [id=ecs_host_role_prod:ecs_instance_role_policy]
data.aws_availability_zones.aws_azs: Read complete after 1s [id=eu-west-1]
module.ecs_cluster.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:eu-west-1:954050840447:cluster/django-prod]
module.ecs_service.aws_ecs_task_definition.this[0]: Refreshing state... [id=django-personal-site]
module.nat.data.aws_ami.this: Read complete after 1s [id=ami-009452531fa1056fa]
module.ecs_cluster.aws_ecs_cluster_capacity_providers.this[0]: Refreshing state... [id=django-prod]
module.ecs_service.data.aws_ecs_task_definition.this[0]: Reading...
module.ecs_service.data.aws_ecs_task_definition.this[0]: Read complete after 0s [id=arn:aws:ecs:eu-west-1:954050840447:task-definition/django-personal-site:1]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-08a301e7900ff17ef]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0e8fc1e1647b7df17]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0e39f2ae61401b1c4]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-06f8c93e4a685e1ab]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-083ae407345a775e5]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0f096da4f7714fcf7]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-09db5785a6dfd071c]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-077f4e93189de9d4e]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0ac9304bc66da227f]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0a2558af275291418]
module.alb.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:954050840447:targetgroup/django-ecs-tg/ea1528c3647317fe]
module.alb_security_group.module.sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-032cfc42b7478e925]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0a92982e3e98f3ad6]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08068361a78700ab1]
module.ecs_service.data.aws_subnet.this[0]: Reading...
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0c2708099d9838709]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-06f8c93e4a685e1ab1080289494]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0a477dbbde07c0098]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-06e0b862f487d38fd]
module.alb_security_group.module.sg.aws_security_group_rule.ingress_rules[1]: Refreshing state... [id=sgrule-3522305327]
module.alb_security_group.module.sg.aws_security_group_rule.ingress_with_self[0]: Refreshing state... [id=sgrule-86115656]
module.ecs_service.data.aws_subnet.this[0]: Read complete after 0s [id=subnet-0a2558af275291418]
module.alb_security_group.module.sg.aws_security_group_rule.ingress_rules[2]: Refreshing state... [id=sgrule-1143663398]
module.alb_security_group.module.sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-441417626]
module.alb_security_group.module.sg.aws_security_group_rule.ingress_rules[3]: Refreshing state... [id=sgrule-2473780471]
module.alb_security_group.module.sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-3552822451]
module.ecs_service.aws_security_group.this[0]: Refreshing state... [id=sg-06555b36d0678f385]
module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:954050840447:loadbalancer/app/django-elb/3d0916a3c7717f9e]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-00d2d71fa8544ec8c]
module.ecs_service.aws_security_group_rule.this["alb_ingress_3000"]: Refreshing state... [id=sgrule-851394091]
module.ecs_service.aws_security_group_rule.this["egress_all"]: Refreshing state... [id=sgrule-2387903463]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0f096da4f7714fcf71080289494]
module.alb.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:954050840447:listener/app/django-elb/3d0916a3c7717f9e/3713d42335b643a3]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_eip.nat will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "nat-instance-main"
        }
      + tags_all             = {
          + "Name" = "nat-instance-main"
        }
      + vpc                  = (known after apply)
    }

  # module.alb.aws_lb_listener.frontend_http_tcp[0] will be updated in-place
  ~ resource "aws_lb_listener" "frontend_http_tcp" {
        id                = "arn:aws:elasticloadbalancing:eu-west-1:954050840447:listener/app/django-elb/3d0916a3c7717f9e/3713d42335b643a3"
        tags              = {
            "ManagedBy" = "Terraform"
        }
        # (5 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:954050840447:targetgroup/django-ecs-tg/ea1528c3647317fe" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.alb.aws_lb_target_group.main[0] must be replaced
+/- resource "aws_lb_target_group" "main" {
      ~ arn                                = "arn:aws:elasticloadbalancing:eu-west-1:954050840447:targetgroup/django-ecs-tg/ea1528c3647317fe" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/django-ecs-tg/ea1528c3647317fe" -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:eu-west-1:954050840447:targetgroup/django-ecs-tg/ea1528c3647317fe" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
        name                               = "django-ecs-tg"
      + name_prefix                        = (known after apply)
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
        tags                               = {
            "ManagedBy" = "Terraform"
            "Name"      = "django-ecs-tg"
        }
      ~ target_type                        = "instance" -> "ip" # forces replacement
        # (9 unchanged attributes hidden)

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }

      - target_failover {}

        # (1 unchanged block hidden)
    }

  # module.ecs_service.aws_appautoscaling_policy.this["cpu"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "cpu"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/django-prod/django-personal-site"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.ecs_service.aws_appautoscaling_policy.this["memory"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "memory"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/django-prod/django-personal-site"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.ecs_service.aws_appautoscaling_target.this[0] will be created
  + resource "aws_appautoscaling_target" "this" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 1
      + resource_id        = "service/django-prod/django-personal-site"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = (known after apply)
    }

  # module.ecs_service.aws_ecs_service.this[0] will be created
  + resource "aws_ecs_service" "this" {
      + cluster                            = "arn:aws:ecs:eu-west-1:954050840447:cluster/django-prod"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 66
      + desired_count                      = 1
      + enable_ecs_managed_tags            = true
      + enable_execute_command             = false
      + force_new_deployment               = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "django-personal-site"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "ManagedBy" = "Terraform"
        }
      + tags_all                           = {
          + "ManagedBy" = "Terraform"
        }
      + task_definition                    = "django-personal-site:1"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "django-app"
          + container_port   = 8000
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-06555b36d0678f385",
            ]
          + subnets          = [
              + "subnet-083ae407345a775e5",
              + "subnet-0a2558af275291418",
            ]
        }

      + timeouts {}
    }

  # module.nat.aws_autoscaling_group.this will be created
  + resource "aws_autoscaling_group" "this" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 1
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = (known after apply)
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 1
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = (known after apply)
      + name_prefix                      = "main"
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = [
          + "subnet-077f4e93189de9d4e",
        ]
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + mixed_instances_policy {
          + instances_distribution {
              + on_demand_allocation_strategy            = (known after apply)
              + on_demand_base_capacity                  = 0
              + on_demand_percentage_above_base_capacity = 0
              + spot_allocation_strategy                 = (known after apply)
              + spot_instance_pools                      = (known after apply)
            }
          + launch_template {
              + launch_template_specification {
                  + launch_template_id   = (known after apply)
                  + launch_template_name = (known after apply)
                  + version              = "$Latest"
                }
              + override {
                  + instance_type = "t3.nano"
                }
              + override {
                  + instance_type = "t3a.nano"
                }
            }
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = false
          + value               = "nat-instance-main"
        }
    }

  # module.nat.aws_iam_instance_profile.this will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "main"
      + path        = "/"
      + role        = (known after apply)
      + tags        = {
          + "Name" = "nat-instance-main"
        }
      + tags_all    = {
          + "Name" = "nat-instance-main"
        }
      + unique_id   = (known after apply)
    }

  # module.nat.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "main"
      + path                  = "/"
      + tags                  = {
          + "Name" = "nat-instance-main"
        }
      + tags_all              = {
          + "Name" = "nat-instance-main"
        }
      + unique_id             = (known after apply)
    }

  # module.nat.aws_iam_role_policy.eni will be created
  + resource "aws_iam_role_policy" "eni" {
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "main"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:AttachNetworkInterface",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.nat.aws_iam_role_policy_attachment.ssm will be created
  + resource "aws_iam_role_policy_attachment" "ssm" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = (known after apply)
    }

  # module.nat.aws_launch_template.this will be created
  + resource "aws_launch_template" "this" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + description     = "Launch template for NAT instance main"
      + id              = (known after apply)
      + image_id        = "ami-009452531fa1056fa"
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = "main"
      + tags            = {
          + "Name" = "nat-instance-main"
        }
      + tags_all        = {
          + "Name" = "nat-instance-main"
        }
      + user_data       = (known after apply)

      + iam_instance_profile {
          + arn = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + network_interfaces {
          + associate_public_ip_address = "true"
          + delete_on_termination       = "true"
          + security_groups             = (known after apply)
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name" = "nat-instance-main"
            }
        }
    }

  # module.nat.aws_network_interface.this will be created
  + resource "aws_network_interface" "this" {
      + arn                       = (known after apply)
      + description               = "ENI for NAT instance main"
      + id                        = (known after apply)
      + interface_type            = (known after apply)
      + ipv4_prefix_count         = (known after apply)
      + ipv4_prefixes             = (known after apply)
      + ipv6_address_count        = (known after apply)
      + ipv6_address_list         = (known after apply)
      + ipv6_address_list_enabled = false
      + ipv6_addresses            = (known after apply)
      + ipv6_prefix_count         = (known after apply)
      + ipv6_prefixes             = (known after apply)
      + mac_address               = (known after apply)
      + outpost_arn               = (known after apply)
      + owner_id                  = (known after apply)
      + private_dns_name          = (known after apply)
      + private_ip                = (known after apply)
      + private_ip_list           = (known after apply)
      + private_ip_list_enabled   = false
      + private_ips               = (known after apply)
      + private_ips_count         = (known after apply)
      + security_groups           = (known after apply)
      + source_dest_check         = false
      + subnet_id                 = "subnet-077f4e93189de9d4e"
      + tags                      = {
          + "Name" = "nat-instance-main"
        }
      + tags_all                  = {
          + "Name" = "nat-instance-main"
        }
    }

  # module.nat.aws_route.this[0] will be created
  + resource "aws_route" "this" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-0f096da4f7714fcf7"
      + state                  = (known after apply)
    }

  # module.nat.aws_route.this[1] will be created
  + resource "aws_route" "this" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.nat.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Security group for NAT instance main"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "main"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "nat-instance-main"
        }
      + tags_all               = {
          + "Name" = "nat-instance-main"
        }
      + vpc_id                 = "vpc-0e1d0243d02de04e0"
    }

  # module.nat.aws_security_group_rule.egress will be created
  + resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "egress"
    }

  # module.nat.aws_security_group_rule.ingress_any will be created
  + resource "aws_security_group_rule" "ingress_any" {
      + cidr_blocks              = [
          + "10.0.1.0/24",
          + "10.0.2.0/24",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.vpc.aws_eip.nat[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_eip" "nat" {
      - allocation_id        = "eipalloc-0a477dbbde07c0098" -> null
      - association_id       = "eipassoc-06e540a10ea810da3" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-0a477dbbde07c0098" -> null
      - network_border_group = "eu-west-1" -> null
      - network_interface    = "eni-02571a2ab9ba78494" -> null
      - private_dns          = "ip-10-0-101-88.eu-west-1.compute.internal" -> null
      - private_ip           = "10.0.101.88" -> null
      - public_dns           = "ec2-108-128-231-136.eu-west-1.compute.amazonaws.com" -> null
      - public_ip            = "108.128.231.136" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags                 = {
          - "ManagedBy" = "Terraform"
          - "Name"      = "django-ecs-vpc-eu-west-1a"
        } -> null
      - tags_all             = {
          - "ManagedBy" = "Terraform"
          - "Name"      = "django-ecs-vpc-eu-west-1a"
        } -> null
      - vpc                  = true -> null
    }

  # module.vpc.aws_nat_gateway.this[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_nat_gateway" "this" {
      - allocation_id                      = "eipalloc-0a477dbbde07c0098" -> null
      - association_id                     = "eipassoc-06e540a10ea810da3" -> null
      - connectivity_type                  = "public" -> null
      - id                                 = "nat-00d2d71fa8544ec8c" -> null
      - network_interface_id               = "eni-02571a2ab9ba78494" -> null
      - private_ip                         = "10.0.101.88" -> null
      - public_ip                          = "108.128.231.136" -> null
      - secondary_allocation_ids           = [] -> null
      - secondary_private_ip_address_count = 0 -> null
      - secondary_private_ip_addresses     = [] -> null
      - subnet_id                          = "subnet-077f4e93189de9d4e" -> null
      - tags                               = {
          - "ManagedBy" = "Terraform"
          - "Name"      = "django-ecs-vpc-eu-west-1a"
        } -> null
      - tags_all                           = {
          - "ManagedBy" = "Terraform"
          - "Name"      = "django-ecs-vpc-eu-west-1a"
        } -> null
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_route" "private_nat_gateway" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - id                     = "r-rtb-0f096da4f7714fcf71080289494" -> null
      - nat_gateway_id         = "nat-00d2d71fa8544ec8c" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-0f096da4f7714fcf7" -> null
      - state                  = "active" -> null

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0f096da4f7714fcf7"
      ~ tags             = {
            "ManagedBy" = "Terraform"
          ~ "Name"      = "django-ecs-vpc-private" -> "django-ecs-vpc-private-eu-west-1a"
        }
      ~ tags_all         = {
          ~ "Name"      = "django-ecs-vpc-private" -> "django-ecs-vpc-private-eu-west-1a"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "django-ecs-vpc-private-eu-west-1b"
        }
      + tags_all         = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "django-ecs-vpc-private-eu-west-1b"
        }
      + vpc_id           = "vpc-0e1d0243d02de04e0"
    }

  # module.vpc.aws_route_table_association.private[1] will be updated in-place
  ~ resource "aws_route_table_association" "private" {
        id             = "rtbassoc-06e0b862f487d38fd"
      ~ route_table_id = "rtb-0f096da4f7714fcf7" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 19 to add, 3 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @phil-ward, Action: `pull_request`, Working Directory: ``, Workflow: `ci`*